BaseConfiguration/Money_2_0/InformationRegisters/СостоянияПроцессовОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПроцессовОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Comment>Используемый вид транспорта для обмена с узлом</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПроцессовОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРезультатаДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПакета</Name>
					<Comment># пакета, используемого в действии. Может не совпадать с номером принятого/отправленного в узле</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>кол-во частей пакета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбработанного</Name>
					<Comment>номер части, которую обработал процесс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗавершениеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцессЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектовВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектовОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОбменаФайлами</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияАвтономныхКопий</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПроцессыОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/СостоянияПроцессовОбменаДанными/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//
#Область ПрограммныйИнтерфейс

// Возвращает структуру состояния процесса обмена данными для указанного узла плана обмена
Функция СостояниеПроцессаДляУзла(Узел, Знач Процесс) Экспорт
	
	Менеджер = ТекущийИлиНовыйМенеджерЗаписи(Узел, Процесс);

	Результат = Новый Структура();
	Для Каждого Поле Из Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными.Измерения Цикл
		Результат.Вставить(Поле.Имя, Менеджер[Поле.Имя]);
	КонецЦикла;
	Для Каждого Поле Из Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными.Ресурсы Цикл
		Результат.Вставить(Поле.Имя, Менеджер[Поле.Имя]);
	КонецЦикла;
	Для Каждого Поле Из Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными.Реквизиты Цикл
		Результат.Вставить(Поле.Имя, Менеджер[Поле.Имя]);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Процедура ОбновитьСостояниеПроцессаДляУзла(Узел, Процесс, знач НовыеЗначения) Экспорт
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	
	НовыеЗначения.Вставить("Узел",  Узел);
	НовыеЗначения.Вставить("Процесс", ?(ЗначениеЗаполнено(Процесс), Процесс, Перечисления.ПроцессыОбменаДанными.ПустаяСсылка()));
	ОбновитьЗапись(НовыеЗначения);
	
КонецПроцедуры


#КонецОбласти




#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостоянияПроцессовОбменаДанными.СоздатьНаборЗаписей();
	Для Каждого КлючИЗначение Из СтруктураЗаписи Цикл		
		ЭлементОтбора = НаборЗаписей.Отбор.Найти(КлючИЗначение.Ключ);
		Если ЭлементОтбора <> Неопределено Тогда
			ЭлементОтбора.Установить(КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьЗапись(СтруктураЗаписи) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными; // ОбъектМетаданныхРегистрСведений
	МенеджерЗаписи = РегистрыСведений.СостоянияПроцессовОбменаДанными.СоздатьМенеджерЗаписи();
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		ИмяИзмерения = Измерение.Имя;
		Если СтруктураЗаписи.Свойство(ИмяИзмерения) Тогда
			МенеджерЗаписи[ИмяИзмерения] = СтруктураЗаписи[ИмяИзмерения];
		КонецЕсли;
		
	КонецЦикла;
	
	МенеджерЗаписи.Прочитать();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ТекущийИлиНовыйМенеджерЗаписи(Узел, Процесс)
	
	Процесс = ?(ЗначениеЗаполнено(Процесс), Процесс, Перечисления.ПроцессыОбменаДанными.ПустаяСсылка());
	Менеджер = РегистрыСведений.СостоянияПроцессовОбменаДанными.СоздатьМенеджерЗаписи();
	Менеджер.Узел = Узел;
	Менеджер.Процесс = Процесс;
	Менеджер.Прочитать();
	
	Если Не Менеджер.Выбран() Тогда
		Менеджер.Узел = Узел;
		Менеджер.Процесс = Процесс;
		ЗаполнитьЗаписьЗначениямиПоУмолчанию(Менеджер);
		Менеджер.Записать(Истина);
	КонецЕсли;
	
	Возврат Менеджер;
	
КонецФункции

Процедура ЗаполнитьЗаписьЗначениямиПоУмолчанию(Запись)
	
	Запись.ДействиеПроцесса          = Перечисления.ДействияПроцессовОбмена.ПустаяСсылка();
	Запись.КодРезультатаДействия     = 0;
	Запись.НомерПакета               = 0;
	Запись.Количество                = 0;
	Запись.НомерОбработанного        = 0;
	Запись.НачалоДействия            = Неопределено;
	Запись.ЗавершениеДействия        = Неопределено;
	Запись.ТекстОшибки               = "";
	Запись.ОбъектовВсего                  = 0;
	Запись.ОбъектовОбработано        = 0;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
